Install MySql Connector.

In [3]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/d8/29/45c72a2292011816aab7f73e778872e79573a2ecc897592f7119ed802a82/mysql_connector_python-8.0.19-cp36-cp36m-manylinux1_x86_64.whl (14.7MB)
     |████████████████████████████████| 14.7MB 75kB/s
Collecting protobuf==3.6.1
  Downloading https://files.pythonhosted.org/packages/c2/f9/28787754923612ca9bfdffc588daa05580ed70698add063a5629d1a4209d/protobuf-3.6.1-cp36-cp36m-manylinux1_x86_64.whl (1.1MB)
     |████████████████████████████████| 1.1MB 38.7MB/s
Collecting dnspython==1.16.0
  Downloading https://files.pythonhosted.org/packages/ec/d3/3aa0e7213ef72b8585747aa0e271a9523e713813b9a20177ebe1e939deb0/dnspython-1.16.0-py2.py3-none-any.whl (188kB)
     |████████████████████████████████| 194kB 49.3MB/s
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (45.1.0)
ERROR: tensorflow-metadata 0.21.1 has requirement protobuf<4,>=3.7, but you'll have protobuf 3.6.1 which is incompatible.
Installing collected packages: protobuf, dnspython, mysql-connector-python
  Found existing installation: protobuf 3.10.0
    Uninstalling protobuf-3.10.0:
      Successfully uninstalled protobuf-3.10.0
Successfully installed dnspython-1.16.0 mysql-connector-python-8.0.19 protobuf-3.6.1

# Import required packages

In [0]:
import pandas as pd

# Retrieve data

1.   Create MySql Connection
2.   Retrieve data from all the required tables & store in a dataframe.
3.   Close Connection

In [0]:
import mysql.connector

# Connect to server
mysql_conn = mysql.connector.connect(
    host='cpanel.insaid.co',
    database='Capstone1',
    user='student',
    password='student')

# Fetch events data result
sql = "SELECT * FROM events_data where state in ('WestBengal', 'Karnataka', 'Gujarat', 'Bihar', 'Punjab', 'Kerala')"
events_data = pd.read_sql(sql, con=mysql_conn)

# Fetch gender result
gender_age_train_full = pd.read_sql("SELECT * FROM gender_age_train", con=mysql_conn)
gender_age_train = pd.read_sql("SELECT * FROM gender_age_train where device_id in (SELECT distinct device_id FROM events_data where state in ('WestBengal', 'Karnataka', 'Gujarat', 'Bihar', 'Punjab', 'Kerala'))", con=mysql_conn)

# Fetch phone brand result
phone_brand_device_model_full = pd.read_sql("SELECT * FROM phone_brand_device_model", con=mysql_conn)
phone_brand_device_model = pd.read_sql("SELECT * FROM phone_brand_device_model where device_id in (SELECT distinct device_id FROM events_data where state in ('WestBengal', 'Karnataka', 'Gujarat', 'Bihar', 'Punjab', 'Kerala'))", con=mysql_conn)

# Close connection
mysql_conn.close()

gender_age_train - Devices and their respective user gender, age and age_group

In [27]:
gender_age_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19032 entries, 0 to 19031
Data columns (total 4 columns):
device_id    19032 non-null int64
gender       19032 non-null object
age          19032 non-null int64
group        19032 non-null object
dtypes: int64(2), object(2)
memory usage: 594.9+ KB

In [38]:
gender_age_train_full.isnull().any()

device_id    False
gender       False
age          False
group        False
dtype: bool

In [28]:
events_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 422915 entries, 0 to 422914
Data columns (total 7 columns):
event_id     422915 non-null int64
device_id    422867 non-null float64
timestamp    422915 non-null datetime64[ns]
longitude    422873 non-null float64
latitude     422873 non-null float64
city         422915 non-null object
state        422915 non-null object
dtypes: datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 22.6+ MB

In [42]:
events_data.isnull().any()

event_id     False
device_id     True
timestamp    False
longitude     True
latitude      True
city         False
state        False
dtype: bool

In [60]:
events_data.isnull().sum()

event_id      0
device_id    48
timestamp     0
longitude    42
latitude     42
city          0
state         0
dtype: int64

In [78]:
#missing data
total = events_data.isnull().sum().sort_values(ascending=False)
percent = (events_data.isnull().sum()/events_data.isnull().count()).sort_values(ascending=False)
missing_data = pd.concat([total, percent], axis=1, keys=['Total', 'Percent'])
missing_data.head(20)
print(missing_data)

           Total   Percent
device_id     48  0.000113
latitude      42  0.000099
longitude     42  0.000099
state          0  0.000000
city           0  0.000000
timestamp      0  0.000000
event_id       0  0.000000

In [0]:
# null values are not even 1% of total data
events_data.dropna(inplace=True)

In [75]:
events_data.describe(include='all')

            event_id     device_id  ...      city       state
count   4.229150e+05  4.228670e+05  ...    422915      422915
unique           NaN           NaN  ...       311           6
top              NaN           NaN  ...  Calcutta  WestBengal
freq             NaN           NaN  ...    122381      196161
first            NaN           NaN  ...       NaN         NaN
last             NaN           NaN  ...       NaN         NaN
mean    1.635566e+06  5.512492e+16  ...       NaN         NaN
std     9.309147e+05  5.330344e+18  ...       NaN         NaN
min     2.088100e+04 -9.221066e+18  ...       NaN         NaN
25%     8.229240e+05 -4.580846e+18  ...       NaN         NaN
50%     1.632964e+06  1.262144e+17  ...       NaN         NaN
75%     2.443410e+06  4.703286e+18  ...       NaN         NaN
max     3.252946e+06  9.222849e+18  ...       NaN         NaN

[13 rows x 7 columns]

In [81]:
events_data.head()

   event_id     device_id           timestamp  ...   latitude      city       state
0     74778  6.173131e+18 2016-05-01 08:02:02  ...  22.652161  Calcutta  WestBengal
1    527238  6.173131e+18 2016-05-02 21:03:22  ...  22.652161  Calcutta  WestBengal
2   1264753  6.173131e+18 2016-05-06 21:36:26  ...  22.652161  Calcutta  WestBengal
3   2252310  6.173131e+18 2016-05-03 23:02:19  ...  22.652161  Calcutta  WestBengal
4   2318262  6.173131e+18 2016-05-03 09:11:20  ...  22.652161  Calcutta  WestBengal

[5 rows x 7 columns]

In [29]:
phone_brand_device_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19032 entries, 0 to 19031
Data columns (total 3 columns):
device_id       19032 non-null int64
phone_brand     19032 non-null object
device_model    19032 non-null object
dtypes: int64(1), object(2)
memory usage: 446.2+ KB

In [39]:
phone_brand_device_model_full.isnull().any()

device_id       False
phone_brand     False
device_model    False
dtype: bool

phone_brand_device_model - device ids, brand, and models phone_brand: note that few brands are in Chinese

Brand Name	Brand English Mapping
'华为'	'Huawei'
'小米'	'Xiaomi'
'三星'	'Samsung'
'vivo'	'vivo'
'OPPO'	'OPPO'
'魅族'	'Meizu'
'酷派'	'Coolpad'
'乐视'	'LeEco'
'联想 '	'Lenovo'
'HTC'	'HTC'

In [31]:
phone_brand_device_model['phone_brand'].unique()

array(['华为', '小米', '三星', 'LG', 'vivo', '欧比', 'OPPO', 'TCL', '酷派', 'HTC',
       '联想 ', '魅族', '海信', '优米', '欧博信', '天语', '努比亚', '夏新', '奇酷', '锤子',
       '酷比魔方', '语信', '朵唯', '德赛', '乐视', '一加', '华硕', '普耐尔', '易派', '摩托罗拉',
       '优购', '酷珀', '梦米', '爱派尔', '昂达', 'LOGO', '邦华', '聆韵', '中国移动', 'ZUK',
       '诺亚信', '酷比', '艾优尼', '斐讯', 'Lovme', '富可视', '欧新', '美图', '宝捷讯', '青橙',
       '果米', '波导', '诺基亚', '神舟', '糯米', '亿通', '纽曼', '唯米', '百立丰', '沃普丰',
       '虾米', '凯利通', '贝尔丰', '至尊宝', '蓝魔', '青葱', '白米', '大可乐', '尼比鲁', '康佳',
       '乡米', '黑米', '海尔', '优语', '维图', '米歌', '广信', 'E派', '小杨树', '糖葫芦', '西米',
       '谷歌', '长虹', '飞利浦', '惠普', '台电', '大Q', '鲜米', '先锋', 'PPTV', '欧奇'],
      dtype=object)

In [44]:
phone_brand_device_model.head()

             device_id phone_brand   device_model
0   176515041953473526          华为          G610S
1 -6876541075223249434          小米           MI 2
2  8026504930081700361          小米           MI 3
3 -7216269352973401877          小米          MI 2S
4  3444770318780911055          三星  Galaxy Note 2

In [0]:
brands_in_chinese = ['华为','小米','三星','魅族','酷派','乐视','联想 ','vivo','OPPO','HTC','LG','TCL','LOGO','Lovme','ZUK','PPTV','努比亚','海信','天语','夏新','欧比', '优米', '欧博信', '奇酷', '锤子', '酷比魔方', '语信', '朵唯', '德赛', '一加',
       '华硕', '普耐尔', '易派', '摩托罗拉', '优购', '酷珀', '梦米', '爱派尔', '昂达', '邦华',
       '聆韵', '中国移动', '诺亚信', '酷比', '艾优尼', '斐讯', '富可视', '欧新', '美图', '宝捷讯',
       '青橙', '果米', '波导', '诺基亚', '神舟', '糯米', '亿通', '纽曼', '唯米', '百立丰',
       '沃普丰', '虾米', '凯利通', '贝尔丰', '至尊宝', '蓝魔', '青葱', '白米', '大可乐', '尼比鲁',
       '康佳', '乡米', '黑米', '海尔', '优语', '维图', '米歌', '广信', 'E派', '小杨树', '糖葫芦',
       '西米', '谷歌', '长虹', '飞利浦', '惠普', '台电', '大Q', '鲜米', '先锋', '欧奇']
brands_in_english = ['Huawei','Xiaomi','Samsung','Meizu','Coolpad','LeEco','Lenovo','vivo','OPPO','HTC','LG','TCL','LOGO','Lovme','ZUK','PPTV','Nubia','Hisense','Amagatarai','Amoi','Obi', 'Youmi', 'Obson', 'Qiku', 'Hammer', 'Cubei Cube', 'Letters', 'Duowei', 'Desai', 'One Plus','ASUS', 'Punale', 'Yipai', 'Motorola', 'Yougo', 'Cooper', 'Mengmi', 'Aipair', 'Onda', 'Banghua', 'Lingyun', 'China Mobile', 'Noah',' Coolby ',' Aiyouni ',' Feixun ',' Focus', 'Ou Xin', 'Meitu', 'Projet News','Green Orange', 'Fruit Rice', 'Flyer', 'Nokia', 'Shenzhou', 'Glutinous Rice', 'Yi Tong', 'Newman', 'Wei Mi', 'Bai Li Feng','Wopfung', 'Shrimp', 'Kellystone', 'Bellfonte', 'Extreme Treasure', 'Blue Devils', 'Scallion', 'White Rice', 'Big Cola', 'Nibiru','Kangjia', 'Xianmi', 'Black Rice', 'Haier', 'Youyu', 'Weitu', 'Mi Ge', 'Guangxin', 'E-Pay', 'Little Poplar', ' Candied ','Simi', 'Google', 'Changhong', 'Philips', 'HP', 'Taipower', 'Big Q', 'Fresh Rice', 'Pioneer', 'Ouqi']

df2 = pd.DataFrame({'phone_brand':brands_in_chinese, 'phone_brand_english':brands_in_english})

In [46]:
df2.head()

  phone_brand phone_brand_english
0          华为              Huawei
1          小米              Xiaomi
2          三星             Samsung
3          魅族               Meizu
4          酷派             Coolpad

In [0]:
phone_brand = phone_brand_device_model.merge(df2, how='left')

In [73]:
phone_brand.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19032 entries, 0 to 19031
Data columns (total 4 columns):
device_id              19032 non-null int64
phone_brand            19032 non-null object
device_model           19032 non-null object
phone_brand_english    19032 non-null object
dtypes: int64(1), object(3)
memory usage: 743.4+ KB

In [84]:
tele_data = events_data.merge(gender_age_train , on='device_id').merge(phone_brand, on='device_id')
tele_data.head()

   event_id     device_id  ... device_model  phone_brand_english
0     76783 -6.822847e+18  ...         MI 3               Xiaomi
1    106517 -6.822847e+18  ...         MI 3               Xiaomi
2    118325 -6.822847e+18  ...         MI 3               Xiaomi
3    190375 -6.822847e+18  ...         MI 3               Xiaomi
4    213495 -6.822847e+18  ...         MI 3               Xiaomi

[5 rows x 13 columns]